RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_clk.c
/*******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_clk.c
 **
 ** A detailed description is available at
 ** @link CmuGroup Clock description @endlink
 **
 **   - 2018-10-13  CDT  First version for Device Driver Library of CMU.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_clk.h"
#include "hc32f460_utility.h"

#if (DDL_CLK_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup CmuGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
#define CLK_XTAL_TIMEOUT                    ((uint16_t)0x1000u)
#define CLK_XTAL32_TIMEOUT                  ((uint8_t)0x05u)
#define CLK_HRC_TIMEOUT                     ((uint16_t)0x1000u)
#define CLK_MRC_TIMEOUT                     ((uint8_t)0x05u)
#define CLK_LRC_TIMEOUT                     ((uint8_t)0x05u)
#define CLK_MPLL_TIMEOUT                    ((uint16_t)0x1000u)
#define CLK_UPLL_TIMEOUT                    ((uint16_t)0x1000u)

/* TBDs 30us based 200M frequency. */
#define CLK_FCG_STABLE                      ((uint16_t)0x200u)
#define CLK_SYSCLK_STABLE                   ((uint16_t)0x200u)
#define CLK_USBCLK_STABLE                   ((uint16_t)0x200u)

#define CLK_PLL_DIV_MIN                     (2u)
#define CLK_PLL_DIV_MAX                     (16u)

#define CLK_PLLQ_DIV_MIN                    (1u)
#define CLK_PLLQ_DIV_MAX                    (16u)

#define CLK_PLLN_MIN                        (20u)
#define CLK_PLLN_MAX                        (480u)

#define CLK_PLLM_MIN                        (1u)
#define CLK_PLLM_MAX                        (24u)

#define CLK_UPLLM_MIN                       (2u)
#define CLK_UPLLM_MAX                       (24u)

#define CLK_PLL_VCO_IN_MIN                  (1u*1000u*1000u)
#define CLK_PLL_VCO_IN_MAX                  (24u*1000u*1000u)

#define CLK_PLL_VCO_OUT_MIN                 (240u*1000u*1000u)
#define CLK_PLL_VCO_OUT_MAX                 (480u*1000u*1000u)

#define ENABLE_FCG0_REG_WRITE()             (M4_MSTP->FCG0PC = 0xa5a50001u)
#define DISABLE_FCG0_REG_WRITE()            (M4_MSTP->FCG0PC = 0xa5a50000u)

#define ENABLE_CLOCK_REG_WRITE()            (M4_SYSREG->PWR_FPRC |= 0xa501u)
#define DISABLE_CLOCK_REG_WRITE()           (M4_SYSREG->PWR_FPRC = (0xa500u | (M4_SYSREG->PWR_FPRC & (uint16_t)(~1u))))

#define ENABLE_CLOCK1_REG_WRITE()           (M4_SYSREG->PWR_FPRC |= 0xa502u)
#define DISABLE_CLOCK1_REG_WRITE()          (M4_SYSREG->PWR_FPRC = (0xa500u | (M4_SYSREG->PWR_FPRC & (uint16_t)(~2u))))


#define DEFAULT_FCG0                        (0xFFFFFAEEul)
#define DEFAULT_FCG1                        (0xFFFFFFFFul)
#define DEFAULT_FCG2                        (0xFFFFFFFFul)
#define DEFAULT_FCG3                        (0xFFFFFFFFul)
#define FCG2_WITHOUT_EMB                    (0xFFFF7FFFul)

#define FCG0_OFFSET_FCM                     (16ul)
#define FCG1_OFFSET_CAN                     (0ul)
#define FCG1_OFFSET_QSPI                    (3ul)
#define FCG1_OFFSET_USBFS                   (8ul)
#define FCG1_OFFSET_SPI1                    (16ul)
#define FCG1_OFFSET_SPI2                    (17ul)
#define FCG1_OFFSET_SPI3                    (18ul)
#define FCG1_OFFSET_SPI4                    (19ul)
#define FCG3_OFFSET_ADC1                    (0ul)
#define FCG3_OFFSET_ADC2                    (1ul)
#define FCG3_OFFSET_DAC                     (4ul)

/*! Parameter validity check for XTAL stablization time \a stb. */
#define IS_XTAL_STB_VALID(stb)                                                 \
(   (ClkXtalStbCycle35          <= (stb))  &&                                  \
    (ClkXtalStbCycle8163        >=  (stb)))

/*! Parameter validity check for pll source \a src. */
#define IS_PLL_SOURCE(src)                                                     \
(   (ClkPllSrcXTAL          ==  (src))      ||                                 \
    (ClkPllSrcHRC           ==  (src)))

/*! Parameter validity check for mpll div \a pllp, pllr, upll div \a pllp, pllq, pllr*/
#define IS_PLL_DIV_VALID(pllx)                                                 \
(   (CLK_PLL_DIV_MIN        <=  (pllx))     &&                                 \
    (CLK_PLL_DIV_MAX        >=  (pllx)))

/*! Parameter validity check for pll div \a pllq. */
#define IS_PLLQ_DIV_VALID(pllx)                                                \
(   (CLK_PLLQ_DIV_MIN        <=  (pllx))    &&                                 \
    (CLK_PLLQ_DIV_MAX        >=  (pllx)))

/*! Parameter validity check for plln \a plln. */
#define IS_PLLN_VALID(plln)                                                    \
(   (CLK_PLLN_MIN           <=  (plln))     &&                                 \
    (CLK_PLLN_MAX           >=  (plln)))

/*! Parameter validity check for pllm \a pllm. */
#define IS_PLLM_VALID(pllm)                                                    \
(   (CLK_PLLM_MIN           <=  (pllm))     &&                                 \
    (CLK_PLLM_MAX           >=  (pllm)))

/*! Parameter validity check for pllm \a pllm. */
#define IS_UPLLM_VALID(pllm)                                                   \
(   (CLK_UPLLM_MIN           <=  (pllm))     &&                                \
    (CLK_UPLLM_MAX           >=  (pllm)))

/*! Parameter validity check for pllsource/pllm \a vco_in. */
#define IS_PLL_VCO_IN_VALID(vco_in)                                            \
(   (CLK_PLL_VCO_IN_MIN     <=  (vco_in))   &&                                 \
    (CLK_PLL_VCO_IN_MAX     >=  (vco_in)))

/*! Parameter validity check for pllsource/pllm*plln \a vco_out. */
#define IS_PLL_VCO_OUT_VALID(vco_out)                                          \
(   (CLK_PLL_VCO_OUT_MIN    <=  (vco_out))  &&                                 \
    (CLK_PLL_VCO_OUT_MAX    >=  (vco_out)))

/*! Parameter validity check for system clock source \a syssrc. */
#define IS_SYSCLK_SOURCE(syssrc)                                               \
(   (ClkSysSrcHRC           ==  (syssrc))   ||                                 \
    ((ClkSysSrcMRC          <=  (syssrc))   &&                                 \
     (CLKSysSrcMPLL         >=  (syssrc))))

/*! Parameter validity check for usb clock source \a usbsrc. */
#define IS_USBCLK_SOURCE(usbsrc)                                               \
(   ((ClkUsbSrcSysDiv2      <=  (usbsrc))   &&                                 \
     (ClkUsbSrcSysDiv4      >=  (usbsrc)))  ||                                 \
    ((ClkUsbSrcMpllp        <=  (usbsrc))   &&                                 \
     (ClkUsbSrcUpllr        >=  (usbsrc))))

/*! Parameter validity check for peripheral(adc/trng/I2S) clock source \a adcsrc. */
#define IS_PERICLK_SOURCE(adcsrc)                                              \
(   (ClkPeriSrcPclk         ==  (adcsrc))   ||                                 \
    ((ClkPeriSrcMpllp       <=  (adcsrc))   &&                                 \
     (ClkPeriSrcUpllr       >=  (adcsrc))))

/*! Parameter validity check for output clock source \a outsrc. */
#define IS_OUTPUTCLK_SOURCE(outsrc)                                            \
(   (ClkOutputSrcHrc        ==  (outsrc))   ||                                 \
    (ClkOutputSrcMrc        ==  (outsrc))   ||                                 \
    (ClkOutputSrcLrc        ==  (outsrc))   ||                                 \
    (ClkOutputSrcXtal       ==  (outsrc))   ||                                 \
    (ClkOutputSrcXtal32     ==  (outsrc))   ||                                 \
    (ClkOutputSrcMpllp      ==  (outsrc))   ||                                 \
    (ClkOutputSrcUpllp      ==  (outsrc))   ||                                 \
    (ClkOutputSrcMpllq      ==  (outsrc))   ||                                 \
    (ClkOutputSrcUpllq      ==  (outsrc))   ||                                 \
    (ClkOutputSrcSysclk     ==  (outsrc)))

/*! Parameter validity check for fcm source \a fcmsrc. */
#define IS_FCM_SOURCE(fcmsrc)                                                  \
(   (ClkFcmSrcXtal          ==  (fcmsrc))   ||                                 \
    ((ClkFcmSrcXtal32       <=  (fcmsrc))   &&                                 \
     (ClkFcmSrcRtcLrc       >=  (fcmsrc))))

/*! Parameter validity check for output clock channel \a outch. */
#define IS_OUTPUTCLK_CHANNEL(outch)                                            \
(   (ClkOutputCh1           ==  (outch))   ||                                  \
    (ClkOutputCh2           ==  (outch)))

/*! Parameter validity check for fcm reference \a ref. */
#define IS_FCM_REF(ref)                                                        \
(   (ClkFcmExtRef           ==  (ref))      ||                                 \
    (ClkFcmInterRef         ==  (ref)))

/*! Parameter validity check for fcm edge \a edge. */
#define IS_FCM_EDGE(edge)                                                      \
(   (ClkFcmEdgeRising       ==  (edge))     ||                                 \
    (ClkFcmEdgeFalling      ==  (edge))     ||                                 \
    (ClkFcmEdgeBoth         ==  (edge)))

/*! Parameter validity check for fcm filter clock \a clk. */
#define IS_FCM_FILTER_CLK(clk)                                                 \
(   (ClkFcmFilterClkNone    ==  (clk))      ||                                 \
    (ClkFcmFilterClkFcmSrc  ==  (clk))      ||                                 \
    (ClkFcmFilterClkFcmSrcDiv4  ==  (clk))  ||                                 \
    (ClkFcmFilterClkFcmSrcDiv16 ==  (clk)))

/*! Parameter validity check for fcm abnormal handle \a handle. */
#define IS_FCM_HANDLE(handle)                                                  \
(   (ClkFcmHandleInterrupt  ==  (handle))   ||                                 \
    (ClkFcmHandleReset      ==  (handle)))

