RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_clk.c
/*! Parameter validity check for debug clock division \a div. */
#define IS_TPIUCLK_DIV_VALID(div)                                              \
(   (ClkTpiuclkDiv1         ==  (div))      ||                                 \
    (ClkTpiuclkDiv2         ==  (div))      ||                                 \
    (ClkTpiuclkDiv4         ==  (div)))

/*! Parameter validity check for output clock division \a div. */
#define IS_OUTPUTCLK_DIV_VALID(div)                                            \
(   (ClkOutputDiv1          ==  (div))      ||                                 \
    ((ClkOutputDiv2         <=  (div))      &&                                 \
     (ClkOutputDiv128       >=  (div))))

/*! Parameter validity check for fcm measurement source division \a div. */
#define IS_FCM_MEASRC_DIV_VALID(div)                                           \
(   (ClkFcmMeaDiv1          ==  (div))      ||                                 \
    (ClkFcmMeaDiv4          ==  (div))      ||                                 \
    (ClkFcmMeaDiv8          ==  (div))      ||                                 \
    (ClkFcmMeaDiv32         ==  (div)))

/*! Parameter validity check for internal reference source division \a div. */
#define IS_FCM_INTREF_DIV_VALID(div)                                           \
(   (ClkFcmIntrefDiv32      ==  (div))      ||                                 \
    (ClkFcmIntrefDiv128     ==  (div))      ||                                 \
    (ClkFcmIntrefDiv1024    ==  (div))      ||                                 \
    (ClkFcmIntrefDiv8192    ==  (div)))

/*! Parameter validity check for system clock config \a cfg. */
#define IS_SYSCLK_CONFIG_VALID(cfg)                                            \
(   ((cfg)->enHclkDiv           <=  ((cfg)->enPclk1Div))    &&                 \
    ((cfg)->enHclkDiv           <=  ((cfg)->enPclk3Div))    &&                 \
    ((cfg)->enHclkDiv           <=  ((cfg)->enPclk4Div))    &&                 \
    ((cfg)->enPclk0Div          <=  ((cfg)->enPclk1Div))    &&                 \
    ((cfg)->enPclk0Div          <=  ((cfg)->enPclk3Div))    &&                 \
    (((cfg)->enPclk2Div-(cfg)->enPclk4Div   ==  3)          ||                 \
    ((cfg)->enPclk2Div-(cfg)->enPclk4Div    ==  2)          ||                 \
    ((cfg)->enPclk2Div-(cfg)->enPclk4Div    ==  1)          ||                 \
    ((cfg)->enPclk2Div-(cfg)->enPclk4Div    ==  0)          ||                 \
    ((cfg)->enPclk4Div-(cfg)->enPclk2Div    ==  1)          ||                 \
    ((cfg)->enPclk4Div-(cfg)->enPclk2Div    ==  2)          ||                 \
    ((cfg)->enPclk4Div-(cfg)->enPclk2Div    ==  3)))


/*! Parameter validity check for clock status \a flag. */
#define IS_CLK_FLAG(flag)                                                      \
(   (ClkFlagHRCRdy        ==  (flag))       ||                                 \
    (ClkFlagXTALRdy       ==  (flag))       ||                                 \
    (ClkFlagMPLLRdy       ==  (flag))       ||                                 \
    (ClkFlagUPLLRdy       ==  (flag))       ||                                 \
    (ClkFlagXTALStoppage  ==  (flag)))
/*! Parameter validity check for fcm status \a flag. */
#define IS_FCM_FLAG(flag)                                                      \
(   (ClkFcmFlagOvf          ==  (flag))     ||                                 \
    (ClkFcmFlagMendf        ==  (flag))     ||                                 \
    (ClkFcmFlagErrf         ==  (flag)))


/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/


/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief  Configures the external high speed oscillator(XTAL).
 **
 ** \param  [in] pstcXtalCfg            The XTAL configures struct.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void CLK_XtalConfig(const stc_clk_xtal_cfg_t *pstcXtalCfg)
{
    if(NULL != pstcXtalCfg)
    {
        ENABLE_CLOCK_REG_WRITE();

        M4_SYSREG->CMU_XTALCFGR_f.SUPDRV = pstcXtalCfg->enFastStartup;
        M4_SYSREG->CMU_XTALCFGR_f.XTALMS = pstcXtalCfg->enMode;
        M4_SYSREG->CMU_XTALCFGR_f.XTALDRV = pstcXtalCfg->enDrv;

        DISABLE_CLOCK_REG_WRITE();
    }
    else
    {
        /* code */
    }
}

/**
 *******************************************************************************
 ** \brief  Configures the XTAL stable time.
 **
 ** \param  [in] enXtalStb              The XTAL stable time.
 **
 ** \retval None
 **
 ** \note   One of the stable clock is 1/8 LRC clock.
 **
 ******************************************************************************/
void CLK_XtalStbConfig(const en_clk_xtal_stb_cycle_t enXtalStb)
{
    DDL_ASSERT(IS_XTAL_STB_VALID(enXtalStb));

    ENABLE_CLOCK_REG_WRITE();

    M4_SYSREG->CMU_XTALSTBCR_f.XTALSTB = enXtalStb;

    DISABLE_CLOCK_REG_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Configures the XTAL stoppage.
 **
 ** \param  [in] pstcXtalStpCfg         The XTAL stoppage configures struct.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void CLK_XtalStpConfig(const stc_clk_xtal_stp_cfg_t *pstcXtalStpCfg)
{
    if(NULL != pstcXtalStpCfg)
    {
        ENABLE_CLOCK_REG_WRITE();

        M4_SYSREG->CMU_XTALSTDCR_f.XTALSTDE = pstcXtalStpCfg->enDetect;
        M4_SYSREG->CMU_XTALSTDCR_f.XTALSTDRIS = pstcXtalStpCfg->enMode;
        M4_SYSREG->CMU_XTALSTDCR_f.XTALSTDRE = pstcXtalStpCfg->enModeReset;
        M4_SYSREG->CMU_XTALSTDCR_f.XTALSTDIE = pstcXtalStpCfg->enModeInt;

