RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_clk.c
    ENABLE_FCG0_REG_WRITE();

    if(NULL != pstcSysclkCfg)
    {
        DDL_ASSERT(IS_SYSCLK_CONFIG_VALID(pstcSysclkCfg));

        /* Only current system clock source is MPLL need to close fcg0~fcg3 and
        open fcg0~fcg3 during switch system clock division.
        We need to backup fcg0~fcg3 before close them. */
        if(CLKSysSrcMPLL == M4_SYSREG->CMU_CKSWR_f.CKSW)
        {
            /* Close fcg0~fcg3. */
            M4_MSTP->FCG0 = DEFAULT_FCG0;
            M4_MSTP->FCG1 = DEFAULT_FCG1;
            M4_MSTP->FCG2 = DEFAULT_FCG2;
            M4_MSTP->FCG3 = DEFAULT_FCG3;

            /* Wait stable after close fcg. */
            do
            {
                timeout++;
            }while(timeout < CLK_FCG_STABLE);
        }

        /* Switch to target system clock division. */
        ENABLE_CLOCK_REG_WRITE();

        M4_SYSREG->CMU_SCFGR = ( (uint32_t)pstcSysclkCfg->enPclk0Div           |
                                ((uint32_t)pstcSysclkCfg->enPclk1Div << 4u)    |
                                ((uint32_t)pstcSysclkCfg->enPclk2Div << 8u)    |
                                ((uint32_t)pstcSysclkCfg->enPclk3Div << 12u)   |
                                ((uint32_t)pstcSysclkCfg->enPclk4Div << 16u)   |
                                ((uint32_t)pstcSysclkCfg->enExclkDiv << 20u)   |
                                ((uint32_t)pstcSysclkCfg->enHclkDiv << 24u)    |
                                ((uint32_t)pstcSysclkCfg->enHclkDiv << 28u));

        DISABLE_CLOCK_REG_WRITE();

        timeout = 0ul;
        do
        {
            timeout++;
        }while(timeout < CLK_SYSCLK_STABLE);

        /* Open fcg0~fcg3. */
        M4_MSTP->FCG0 = fcg0;
        M4_MSTP->FCG1 = fcg1;
        M4_MSTP->FCG2 = fcg2;
        M4_MSTP->FCG3 = fcg3;

        DISABLE_FCG0_REG_WRITE();

        /* Wait stable after open fcg. */
        timeout = 0ul;
        do
        {
            timeout++;
        }while(timeout < CLK_FCG_STABLE);
    }
    else
    {
        /* code */
    }
}


/**
 *******************************************************************************
 ** \brief  Get clock frequency.
 **
 ** \param  [in] pstcClkFreq            The clock source struct.
 **
 ** \retval The clock frequency include system clock,hclk,exck,pclk0,pclk1,pclk2
 **         pclk3,pclk4.
 **
 ** \note   None
 **
 ******************************************************************************/
void CLK_GetClockFreq(stc_clk_freq_t *pstcClkFreq)
{
    uint32_t plln = 0u, pllp = 0u, pllm = 0u, pllsource = 0u;

    if(NULL != pstcClkFreq)
    {
        /* Get system clock. */
        switch(M4_SYSREG->CMU_CKSWR_f.CKSW)
        {
            case ClkSysSrcHRC:
                /* HRC used as system clock. */
                pstcClkFreq->sysclkFreq = HRC_VALUE;
                break;
            case ClkSysSrcMRC:
                /* MRC used as system clock. */
                pstcClkFreq->sysclkFreq = MRC_VALUE;
                break;
            case ClkSysSrcLRC:
                /* LRC used as system clock. */
                pstcClkFreq->sysclkFreq = LRC_VALUE;
                break;
            case ClkSysSrcXTAL:
                /* XTAL used as system clock. */
                pstcClkFreq->sysclkFreq = XTAL_VALUE;
                break;
            case ClkSysSrcXTAL32:
                /* XTAL32 used as system clock. */
                pstcClkFreq->sysclkFreq = XTAL32_VALUE;
                break;
            default:
                /* MPLLP used as system clock. */
                pllsource = M4_SYSREG->CMU_PLLCFGR_f.PLLSRC;
                pllp = M4_SYSREG->CMU_PLLCFGR_f.MPLLP;
                plln = M4_SYSREG->CMU_PLLCFGR_f.MPLLN;
                pllm = M4_SYSREG->CMU_PLLCFGR_f.MPLLM;

                /* PLLCLK = ((pllsrc / pllm) * plln) / pllp */
                if (ClkPllSrcXTAL == pllsource)
                {
                    pstcClkFreq->sysclkFreq = (XTAL_VALUE)/(pllm+1u)*(plln+1u)/(pllp+1u);
                }
                else if (ClkPllSrcHRC == pllsource)
                {
                    pstcClkFreq->sysclkFreq = (HRC_VALUE)/(pllm+1u)*(plln+1u)/(pllp+1u);
                }
                else
                {
                    //else
                }
                break;
        }

        /* Get hclk. */
        pstcClkFreq->hclkFreq = pstcClkFreq->sysclkFreq >> M4_SYSREG->CMU_SCFGR_f.HCLKS;

        /* Get exck. */
        pstcClkFreq->exckFreq = pstcClkFreq->sysclkFreq >> M4_SYSREG->CMU_SCFGR_f.EXCKS;

        /* Get pclk0. */
        pstcClkFreq->pclk0Freq = pstcClkFreq->sysclkFreq >> M4_SYSREG->CMU_SCFGR_f.PCLK0S;

        /* Get pclk1. */
        pstcClkFreq->pclk1Freq = pstcClkFreq->sysclkFreq >> M4_SYSREG->CMU_SCFGR_f.PCLK1S;

        /* Get pclk2. */
        pstcClkFreq->pclk2Freq = pstcClkFreq->sysclkFreq >> M4_SYSREG->CMU_SCFGR_f.PCLK2S;

        /* Get pclk3. */
        pstcClkFreq->pclk3Freq = pstcClkFreq->sysclkFreq >> M4_SYSREG->CMU_SCFGR_f.PCLK3S;

        /* Get pclk4. */
        pstcClkFreq->pclk4Freq = pstcClkFreq->sysclkFreq >> M4_SYSREG->CMU_SCFGR_f.PCLK4S;
    }
    else
    {
        /* code */
    }
}

/**
 *******************************************************************************
 ** \brief  Get PLL clock frequency.
 **
 ** \param  [in] pstcPllClkFreq        The PLL clock source struct.
 **
 ** \retval The clock frequency include mpllp, mpllq, mpllr, upllp, upllq, upllr.
 **
 ** \note   None
 **
 ******************************************************************************/
void CLK_GetPllClockFreq(stc_pll_clk_freq_t *pstcPllClkFreq)
{
    uint32_t pllsource;
    uint32_t mplln = 0u, mpllp = 0u, mpllq = 0u, mpllr = 0u, mpllm = 0u;
    uint32_t uplln = 0u, upllp = 0u, upllq = 0u, upllr = 0u, upllm = 0u;

    /* Get pll clock source */
    pllsource = M4_SYSREG->CMU_PLLCFGR_f.PLLSRC;

    /* Get Mpll parameter value */
    mpllp = M4_SYSREG->CMU_PLLCFGR_f.MPLLP;
    mpllq = M4_SYSREG->CMU_PLLCFGR_f.MPLLQ;
    mpllr = M4_SYSREG->CMU_PLLCFGR_f.MPLLR;
    mplln = M4_SYSREG->CMU_PLLCFGR_f.MPLLN;
    mpllm = M4_SYSREG->CMU_PLLCFGR_f.MPLLM;

