RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_clk.c
    M4_FCM->STR = enNewState;
}

/**
 *******************************************************************************
 ** \brief  Get fcm counter value.
 **
 ** \param  None
 **
 ** \retval The fcm counter value.
 **
 ** \note   None
 **
 ******************************************************************************/
uint16_t CLK_GetFcmCounter(void)
{
    return (uint16_t)(M4_FCM->CNTR & 0xFFFFu);
}

/**
 *******************************************************************************
 ** \brief  Get the specified fcm flag status.
 **
 ** \param  [in] enFcmFlag              The specified fcm flag.
 ** \arg    ClkFcmFlagOvf               The fcm counter overflow or not.
 ** \arg    ClkFcmFlagMendf             The end of the measurement or not.
 ** \arg    ClkFcmFlagErrf              Whether the frequency is abnormal or not.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
en_flag_status_t CLK_GetFcmFlag(en_clk_fcm_flag_t enFcmFlag)
{
    en_flag_status_t status = Reset;

    DDL_ASSERT(IS_FCM_FLAG(enFcmFlag));

    switch(enFcmFlag)
    {
        case ClkFcmFlagOvf:
            status = (en_flag_status_t)M4_FCM->SR_f.OVF;
            break;
        case ClkFcmFlagMendf:
            status = (en_flag_status_t)M4_FCM->SR_f.MENDF;
            break;
        case ClkFcmFlagErrf:
            status = (en_flag_status_t)M4_FCM->SR_f.ERRF;
            break;
        default:
            break;
    }

    return status;
}

/**
 *******************************************************************************
 ** \brief  Clear the specified fcm flag status.
 **
 ** \param  [in] enFcmFlag              The specified fcm flag.
 ** \arg    ClkFcmFlagOvf               Clear the fcm counter overflow flag.
 ** \arg    ClkFcmFlagMendf             Clear the end of the measurement flag.
 ** \arg    ClkFcmFlagErrf              Clear the frequency abnormal flag.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
void CLK_ClearFcmFlag(en_clk_fcm_flag_t enFcmFlag)
{
    DDL_ASSERT(IS_FCM_FLAG(enFcmFlag));

    switch(enFcmFlag)
    {
        case ClkFcmFlagOvf:
            M4_FCM->CLR_f.OVFCLR = Set;
            break;
        case ClkFcmFlagMendf:
            M4_FCM->CLR_f.MENDFCLR = Set;
            break;
        case ClkFcmFlagErrf:
            M4_FCM->CLR_f.ERRFCLR = Set;
            break;
        default:
            break;
    }
}

/**
 *******************************************************************************
 ** \brief  Clear the XTAL error flag.
 **
 ** \param  None
 **
 ** \retval None
 **
 ** \note   The system clock should not be XTAL before call this function.
 **
 ******************************************************************************/
void CLK_ClearXtalStdFlag(void)
{
    /* Enable register write. */
    ENABLE_CLOCK_REG_WRITE();

    if(Set == M4_SYSREG->CMU_XTALSTDSR_f.XTALSTDF)
    {
        /* Clear the XTAL STD flag */
        M4_SYSREG->CMU_XTALSTDSR_f.XTALSTDF = Reset;
    }

    /* Disbale register write. */
    DISABLE_CLOCK_REG_WRITE();
}


//@} // CmuGroup

#endif /* DDL_CLK_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
